package models

var Baccarat = map[string]float64{
	"庄":   0.4586,
	"闲":   0.44624,
	"和":   0.09516,
	"小":   0.3788,
	"大":   0.6211,
	"闲对":  0.0747,
	"庄对":  0.0747,
	"幸运6": 0.09,
	"超级6": 0.06,
}
var MarkSix = map[string]float64{}

var FastThree = map[string]float64{
	"三军":      0.4212,
	"短牌":      0.074074,
	"长牌":      0.1388,
	"豹子 点数":   0.00462,
	"和值 大小单双": 0.4861,
	"和值 4点":   0.01388,
	"和值 5点":   0.02777,
	"和值 6点":   0.04629,
	"和值 7点":   0.06944,
	"和值 8点":   0.09722,
	"和值 9点":   0.11574,
	"和值 10点":  0.125,
	"和值 11点":  0.125,
	"和值 12点":  0.11574,
	"和值 13点":  0.09722,
	"和值 14点":  0.06944,
	"和值 15点":  0.04629,
	"和值 16点":  0.02777,
	"和值 17点":  0.01388,
	"二同号":     0.01388,
	"三不同":     0.02777,
	"豹子 全骰":   0.02777,
}

var ColorfulFive = map[string]float64{
	"定位胆": 0.1,
}

var RacingTen = map[string]float64{
	"定位胆": 0.1,
}

var PC28 = map[string]float64{
	"总和组合 大单小双": 0.1,
	"总和组合 大双小单": 0.1,
}
